TcMenu/tcLibraryDev/stm32eth/stm32eth_main.cpp
/*
  Web Server
 A simple web server that shows the value of the analog input pins.
 Circuit:
 * STM32 board with Ethernet support
 * Analog inputs attached to pins A0 through A5 (optional)
 created 18 Dec 2009
 by David A. Mellis
 modified 9 Apr 2012
 by Tom Igoe
 modified 02 Sept 2015
 by Arturo Guadalupi
 modified 23 Jun 2017
 by Wi6Labs
 modified 1 Jun 2018
 by sstaub
 */

int servedPages = 0;

#include <Wire.h>
#include <LwIP.h>
#include <STM32Ethernet.h>

// Enter an IP address for your controller below.
// The IP address will be dependent on your local network:
IPAddress ip(192, 168, 0, 154);

// Initialize the Ethernet server library
// with the IP address and port you want to use
// (port 80 is default for HTTP):
EthernetServer server(80);

void setup() {
    // Open serial communications and wait for port to open:
    Serial.begin(115200);
    while (!Serial) {
        ; // wait for serial port to connect. Needed for native USB port only
    }


    // start the Ethernet connection and the server:
    Ethernet.begin(ip);
    server.begin();
    Serial.print("server is at ");
    Serial.println(Ethernet.localIP());
}


void loop() {
    // listen for incoming clients
    EthernetClient client = server.available();
    if (client) {
        servedPages++;

        Serial.println("new client");
        // an http request ends with a blank line
        bool currentLineIsBlank = true;
        while (client.connected()) {
            if (client.available()) {
                char c = client.read();
                Serial.write(c);
                // if you've gotten to the end of the line (received a newline
                // character) and the line is blank, the http request has ended,
                // so you can send a reply
                if (c == '\n' && currentLineIsBlank) {
                    // send a standard http response header
                    client.println("HTTP/1.1 200 OK");
                    client.println("Content-Type: text/html");
                    client.println("Connection: close");  // the connection will be closed after completion of the response
                    client.println("Refresh: 5");  // refresh the page automatically every 5 sec
                    client.println();
                    client.println("<!DOCTYPE HTML>");
                    client.println("<html>");
                    client.print("<h1>");
                    client.print(servedPages);
                    client.println("</h1>");
                    // output the value of each analog input pin
                    for(int i=0;i<100;i++) {
                        for (int analogChannel = 0; analogChannel < 6; analogChannel++) {
                            int sensorReading = analogRead(analogChannel);
                            client.print("analog input ");
                            client.print(analogChannel);
                            client.print(" is ");
                            client.print(sensorReading);
                            client.println("<br />");
                        }
                    }

                    client.println("</html>");
                    break;
                }
                if (c == '\n') {
                    // you're starting a new line
                    currentLineIsBlank = true;
                } else if (c != '\r') {
                    // you've gotten a character on the current line
                    currentLineIsBlank = false;
                }
            }
        }
        // give the web browser time to receive the data
        delay(1);
        // close the connection:
        client.stop();
        Serial.println("client disconnected");
    }
}